#####################################################
# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle
#####################################################

# homebrew taps
tap 'homebrew/bundle'
# tap 'homebrew/core'
tap 'homebrew/services'

# Python - used by mackup and watchman
brew 'python'
# brew 'pyenv' # Don't install pyenv via homebrew and pyenv has interoperability issues
# https://matt.sh/unify-python
# https://towardsdatascience.com/homebrew-and-pyenv-python-playing-pleasantly-in-partnership-3a342d86319b

# Rust  
# brew 'rustup-init'

# Fly.io 
brew 'flyctl'

# Updated Ruby (https://jekyllrb.com/docs/installation/macos/)
brew 'ruby'

# apps
brew 'bash-completion'
brew 'git'
brew 'mackup'
brew 'jq'
brew 'gpm'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'tree'
brew 'openssl'
brew 'wget'
brew 'grep'
brew 'wrk'
brew 'telnet'
brew 'asciinema'

# https://upx.github.io/
# brew 'upx'

# https://github.com/junegunn/fzf#fuzzy-completion-for-bash-and-zsh
# brew 'fzf' 

# Deno
# brew 'deno'

# AWS Serverless CLI (https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install-mac.html)
# tap 'aws/tap'
# brew 'aws-sam-cli'
# brew 'awscli'

# netlify
tap 'netlify/netlifyctl'
brew 'netlifyctl'

# hygen templates  https://github.com/jondot/hygen
tap 'jondot/tap'
brew 'hygen'

# ZSH Stuff
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Other GNU utils
brew 'gnu-sed'#, args: ['with-default-names']
brew 'gnu-tar'#, args: ['with-default-names']
brew 'gnu-which'#, args: ['with-default-names']

# Go Stuff
# tap 'go-delve/delve'
brew 'go'
brew 'kubectl'
brew 'helm'

# React
# brew 'yarn'
# Watchman is a tool by Facebook for watching changes in the filesystem.
# brew 'watchman'

# Databases
brew 'postgresql@15'
brew 'redis'
brew 'sqlite'
brew 'duckdb'

# Supabase
tap 'supabase/tap'
brew 'supabase'

# dependencies
# brew 'gdbm'
# brew 'pcre'
# brew 'libidn'
# brew 'svn'

# Pilosa Console https://www.pilosa.com
# tap 'pilosa/homebrew-pilosa'
# brew 'pilosa-console'

# brew 'smartmontools'

# stripe CLI https://stripe.com/docs/stripe-cli#install
# tap 'stripe/stripe-cli'
# brew 'stripe'

# Video
# brew 'ffmpeg'
# brew 'mpv'


#####################################################
# Casks
#####################################################
# tap 'homebrew/cask'
# cask_args appdir: "~/Applications", require_sha: true
cask_args require_sha: true

# -------------------------
cask 'visual-studio-code'
cask 'github'
cask 'google-chrome'
cask 'firefox'
# cask 'google-cloud-sdk'
cask 'iterm2'
cask 'warp'
# cask 'hyper'
cask 'keepingyouawake'
# cask 'ngrok'
cask 'rectangle'
cask 'topnotch'
cask 'numi'
# cask 'spotify'

# inkscape
# cask 'xquartz'
# cask 'inkscape'

# API tool
cask 'insomnia'

# Note taking
cask 'obsidian'

# broadcasting
cask 'zoom'
cask 'obs'
cask 'vlc'

# Barrier KVM https://github.com/debauchee/barrier
# cask 'barrier'

# --- Other ---
# cask 'slack'
cask 'cheatsheet'
# cask 'dropzone'
cask 'monitorcontrol'
cask 'logi-options-plus'
# cask 'filezilla'
# cask 'handbrake'
# cask 'keybase'
# cask 'telegram'
# cask 'sketch'

# minikube uses virtualbox so it must be first
# cask 'virtualbox' 
# cask 'minikube'

# SQL tools
# cask 'popsql'
# tap 'benbjohnson/litestream'
# brew 'litestream'
cask 'tableplus'
cask 'beekeeper-studio'

# GitHub Credential Manager
tap 'microsoft/git'
cask 'git-credential-manager-core'

# Dynamodb
cask 'nosql-workbench'

# Raindrop bookmark manager
cask 'raindropio'

# https://github.com/buo/homebrew-cask-upgrade
# brew-cask-upgrade is a command-line tool for upgrading every 
# outdated app installed by Homebrew Cask.
tap 'buo/cask-upgrade'

# install fonts
tap 'homebrew/cask-fonts'
# --------------------------
# cask 'font-hack'
cask 'font-hasklig'
# cask 'font-monoid'
# cask 'font-source-code-pro'
# cask 'font-iosevka'
# cask 'font-input'
# cask 'font-jetbrains-mono'
# cask 'font-jetbrains-mono-nerd-font'


#####################################################
# Whalebrew
# https://github.com/whalebrew/whalebrew
#####################################################
# brew 'whalebrew'
# whalebrew 'whalebrew/wget'


#####################################################
# Mas Apps (Mac App Store)
# https://github.com/mas-cli/mas
#####################################################
brew 'mas'

# ---- Microsoft ----
mas 'OneDrive', id: 823766827
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Microsoft To Do', id: 1274495053
mas 'Microsoft OneNote', id: 784801555
mas 'Microsoft Outlook', id: 985367838
mas 'Microsoft Word', id: 462054704
mas 'Microsoft PowerPoint', id: 462062816

# ----- Other -----
mas 'Drafts', id: 1435957248
mas 'Craft', id: 1487937127
mas 'Evernote', id: 406056744
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Things', id: 904280696
mas 'Slack', id: 803453959
mas 'Todoist', id: 585829637
mas 'Disk Speed Test', id: 425264550
mas 'iMovie', id: 408981434
mas 'LastPass', id: 926036361
mas 'Tailscale', id: 1475387142

# --- Native Apps ---
# mas 'Xcode', id: 497799835
# mas 'GarageBand', id: 682658836
# mas 'iMovie', id: 408981434
# mas 'Pages', id: 409201541
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825




#####################################################
# Examples
#####################################################

# tap 'telemachus/brew', 'https://telemachus@bitbucket.org/telemachus/brew.git'
# brew 'imagemagick'
# brew 'mysql', restart_service: true, conflicts_with: ['homebrew/versions/mysql56']
# brew 'emacs', args: ['with-cocoa', 'with-gnutls']
# cask 'google-chrome'
# cask 'java' unless system '/usr/libexec/java_home --failfast'
# cask 'firefox', args: { appdir: '~/my-apps/Applications' }


# Homebrew Services
# Integrates Homebrew formulae with macOS' launchctl manager.
# -------------------------

# Start the MySQL service at login with:
# brew services start mysql

# Start the Dnsmasq service at boot with:
# sudo brew services start dnsmasq

# Start all available services with:
# brew services start --all