# homebrew apps
tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'homebrew/core'
tap 'go-delve/delve'
tap 'kryptco/tap'
# -------------------------
brew 'bash-completion'
brew 'git'

brew 'hugo'
brew 'mackup'
brew 'n'
brew 'jq'
brew 'gpm'
brew 'openssl'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'lastpass-cli', args: ['with-pinentry', 'with-doc']
brew 'tree'
brew 'vault'
brew 'wget', args: ['with-iri']
brew 'grep' #, args: ['with-default-names']
brew 'zsh'
brew 'zsh-completions'
brew 'wrk'
brew 'upx'
brew 'telnet'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Other GNU utils
brew 'gnu-sed'#, args: ['with-default-names']
brew 'gnu-tar'#, args: ['with-default-names']
brew 'gnu-which'#, args: ['with-default-names']

# Go Stuff
brew 'go'
brew 'dep'
brew 'go-delve/delve/delve'
brew 'kubectl'
brew 'kubernetes-helm'

# Python
brew 'python'

# React
brew 'yarn', args: ['without-node']
# Watchman is a tool by Facebook for watching changes in the filesystem.
brew 'watchman'
# secure ssh
brew 'kryptco/tap/kr'

# dependencies
brew 'gdbm'
brew 'pcre'
brew 'libidn'

# install casks
tap 'caskroom/cask'
cask_args appdir: '/Applications'
# -------------------------
cask 'atom'
cask 'visual-studio-code'
cask 'cheatsheet'
cask 'filezilla'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'kitematic'
cask 'handbrake'
cask 'iterm2'
cask 'keepingyouawake'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'keybase'
cask 'telegram'
cask 'sketch'
cask 'ngrok'

# API tool
cask 'insomnia'

# minikube uses virtualbox so it must be first
cask 'virtualbox' 
cask 'minikube'

cask 'popsql'

# https://github.com/buo/homebrew-cask-upgrade
tap 'buo/cask-upgrade'

# install fonts
tap 'caskroom/fonts'
# --------------------------
cask 'caskroom/fonts/font-hack'
cask 'caskroom/fonts/font-hasklig'
cask 'caskroom/fonts/font-monoid'
cask 'caskroom/fonts/font-source-code-pro'
cask 'caskroom/fonts/font-iosevka'
cask 'caskroom/fonts/font-input'

# install app store apps
brew 'mas'
# -------------------------
mas 'Clear', id: 504544917
mas 'Skitch', id: 425955336
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Xcode', id: 497799835
mas 'Slack', id: 803453959
mas 'Evernote', id: 406056744
mas 'Todoist', id: 585829637

# mas 'Bitcoin Expert', id: 1237809495

# mas 'Pages', id: 409201541
# mas 'Numbers', id: 409203825
# mas 'Keynote', id: 409183694

# mas 'iMovie', id: 408981434

# mas 'Twitter', id: 409789998
# mas 'iPhoto', id: 408981381
# mas 'TurboTax 2015', id: 1061844571
# mas 'LastPass', id: 926036361
# mas 'Aperture', id: 408981426


# mas "Blackmagic Disk Speed Test", id: 425264550
# mas "CARROT Weather", id: 993487541
# mas "CCMenu", id: 603117688
# mas "DrCleaner", id: 921458519
# mas "Frame.io", id: 992958444
# mas "iMovie", id: 408981434
# mas "Magnet", id: 441258766
# mas "QuickBooks", id: 640830064
# mas "WiFi Explorer", id: 494803304
# mas "WiFi Signal", id: 525912054


# ***  Examples ***

# tap 'telemachus/brew', 'https://telemachus@bitbucket.org/telemachus/brew.git'
# brew 'imagemagick'
# brew 'mysql', restart_service: true, conflicts_with: ['homebrew/versions/mysql56']
# brew 'emacs', args: ['with-cocoa', 'with-gnutls']
# cask 'google-chrome'
# cask 'java' unless system '/usr/libexec/java_home --failfast'
# cask 'firefox', args: { appdir: '~/my-apps/Applications' }
